# 변수 - 값을 저장하는 공간
# 변수는 의미가 있는 단어로 구성을 하면 더 좋음.
# 예약어는 변수로 사용할 수 없음.
# print()

# 타입 - 숫자,문자열,참,거짓

# c,java 타입선언을 하지만, 파이썬은 타입선언이 없음.
# 변수 = 리터럴(값)
a = 10
number = 10
print1 = 10
print(print1) # 예약어(print,True 등)는 변수로 사용불가 
# 대신 숫자나 _를 붙이면 사용 가능 (특수문자는 _만 사용가능)
# 10num = 10 숫자로 시작되는 변수는 사용할 수 없음.
# num10 = 10 은 가능
# 대,소문자 구분 확실히 ex(No = 10 , no = 10 은 다름.
# n o = 10 공백(띄어쓰기)은 사용할 수 없음.

num = 10
a2 = 123456789*321
a3 = a2+1000000
result = a2+1000000
total = a2+1000000
hap = a2+1000000

b = 1.5
c = "안녕"
d = True
e = False
