#print("[이코노미스트 송현주 기자] 국내 투자자들에게 \
#    \n‘미국 주식’은 늘 새벽의 상징이었다. 잠들지 못한 채 \
#    \n핸드폰을 들여다보며 뉴욕증시 개장을 기다리는 밤, \
#    \n혹은 출근길에 확인하는 간밤의 손익. 그러나 오는 11월 4일, \
#    \n이 풍경이 달라진다. 미국 주식 주간거래(데이타임 트레이딩) 서비스가 1년여 만에 다시 문을 열면서, 국내 투자자들은 한국 시간 낮에도 미국 주식을 사고팔 수 있는 시대를 맞게 된다.금융투자업계에 따르면 교보증권·대신증권·메리츠증권·미래에셋증권·삼성증권·신한금융투자·키움증권·토스증권·NH투자증권·한국투자증권 등 18개 증권사가 순차적으로 서비스를 재개할 예정이다.")

# """ 쌍따옴표 3개는 있는 그대로 출력
print("""
[이코노미스트 송현주 기자] 국내 투자자들에게 
‘미국 주식’은 늘 새벽의 상징이었다. 잠들지 못한 채
핸드폰을 들여다보며 뉴욕증시 개장을 기다리는 밤,
혹은 출근길에 확인하는 간밤의 손익. 그러나 오는 11월 4일,
이 풍경이 달라진다. 미국 주식 주간거래(데이타임 트레이딩) 
서비스가 1년여 만에 다시 문을 열면서, 국내 투자자들은 
한국 시간 낮에도 미국 주식을 사고팔 수 있는 시대를 맞게 된다.
금융투자업계에 따르면 교보증권·대신증권·메리츠증권·
미래에셋증권·삼성증권·신한금융투자·키움증권·토스증권·NH투자증권·한국투자증권 등 
18개 증권사가 순차적으로 서비스를 재개할 예정이다.""")

