# 산술연산자
# + : 더하기
# - : 빼기
# *: 곱하기
# / : 나누기
# // : 몫
# % : 나머지
# **: 제곱

# # print(10+20)
# # print(10-20)
# # print(10*20)
# # print(10/20)
# # print(10/3)   # 3.33333
# # print(10//3)  # 3 몫
# # print(10%3)  # 1 나머지
# # print(10**3)  # 10*10*10 =1000

# # 두 수를 입력받아 위의 연산을 출력하시오.
# # +,*,-,/,//,%,**

# n1 = int(input("숫자를 입력하시오."))
# n2 = int(input("숫자를 입력하시오."))
# print(n1+n2)
# print(n1-n2)
# print(n1*n2)
# print(n1/n2)
# print(n1//n2)
# print(n1%n2)
# print(n1**n2)

### 780원 동전으로 교환
### 500원,100원,50원,10원 동전 개수 계산
# 값/500:1(몫), 나머지/100:2(몫), 나머지/50:1(몫), 나머지/10:3(몫)
# coin =1234567890
# money1 = 1234567890//500    #500원 몫-개수
# money2 = 1234567890%500     #500원 나머지
# money3 = money2//100 #100원 몫-개수
# money4 = money2%100  #100원 나머지
# money5 = money4//50  #50원 몫-개수
# money6 = money4%50   #50원 나머지
# money7 = money6//10  #10원 몫-개수

# print("500 동전 : %d개"% money1)
# print("100 동전 : %d개"% money3)
# print("50 동전 : %d개"% money5)
# print("10 동전 : %d개"% money7)

coin = 1597000
# 50000원:31장, 10000원, 5000원, 1000원
m1 =coin//50000
m2 =coin%50000
m3 = m2//10000
m4 = m2%10000
m5 = m4//5000
m6 = m4%5000
m7 = m6//1000
m8 = m6%1000

print("50000원권 : %d장" % m1)
print("10000원권 : %d장" % m3)
print("5000원권 : %d장" % m5)
print("1000원권 : %d장" % m7)
print("남은금액 : %d원" % m8)



